Revit 2027 API
ParameterTypeId.RbsReferenceInsulationThickness Property
 "Insulation Thickness": This parameter is obsolete. Use DUCT_INSULATION_THICKNESS and PIPE_INSULATION_THICKNESS.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsReferenceInsulationThickness { get; }
Public Shared ReadOnly Property RbsReferenceInsulationThickness As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsReferenceInsulationThickness {
	ForgeTypeId^ get ();
}
static member RbsReferenceInsulationThickness : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace